/* The string for canceling a map editing function. */
"CancelKey" = "إلغاء";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "هل تريد الإلغاء بالتأكيد؟";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "لن يتم حفظ التغييرات التي أجريتها.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "لن يتم حفظ الكائن المنشأ.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "تجاهل التغييرات";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "إلغاء التحرير";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "عنوان غير صالح";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "يجب تضمين أي عنوان للنقطة.";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "لم تقم بإضافة موقع لهذه النقطة";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "لن تتم إضافة أية نقطة جديدة";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "متابعة التحرير";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "حدد النقطة التي تريد حذفها.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "لا توجد نقاط لحذفها.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "موافق";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "هل تريد بالتأكيد مسح جميع النقاط؟";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "لا";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "نعم";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "هل تريد التبديل إلى نقطة؟";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "هل تريد التبديل إلى شكل متعدد الخطوط؟";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "هل تريد التبديل إلى مضلع؟";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "لن يتم تغيير النقاط التي أضفتها ويمكنك متابعة إنشاء الكائن";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "سيتم حذف جميع النقاط المضافة الخاصة بك";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "هل تريد بالتأكيد مسح هذه النقطة؟";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "حفظ";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "تصفية";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "الموقع الحالي";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "لم يتم العثور على اقتراحات";

/* The text of the editingPanel Address textField. */
"AddressKey" = "العنوان";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "مسح الكل";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "تم إنشاء %@ بنجاح";

/* The placeholder text of the Searchbar */
"SearchKey" = "بحث";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "إضافة نقطة جديدة";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "الخريطة الأساسية";

/* The title for the standard map type. */
"StandardKey" = "قياسي";

/* The title for the hybrid map type. */
"HybridKey" = "مختلَط";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "استعراض جوي مختلط";

/* The title for the muted standard map type. */
"MutedStandardKey" = "معيار صامت";

/* The title for the satellite map type. */
"SatelliteKey" = "قمر صناعي";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "استعراض جوي لقمر صناعي";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "إضافة موقع";

